Autodesk.Revit.DB.SolidArray
An array that contains solids.

Autodesk.Revit.DB.SolidArray.Insert(Autodesk.Revit.DB.Solid,System.Int32)
System.Int32
Insert the specified solid into the array.
item: The solid to be inserted into the array.
index: The solid will be inserted before this index.
Returns: Returns whether the solid was inserted into the array.

Autodesk.Revit.DB.SolidArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.SolidArray.ReverseIterator
Autodesk.Revit.DB.SolidArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.SolidArray.ForwardIterator
Autodesk.Revit.DB.SolidArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.SolidArray.Append(Autodesk.Revit.DB.Solid)
void
Add the solid to the end of the array.
item: The solid to be added.

Autodesk.Revit.DB.SolidArray.Clear
void
Removes every solid from the array, rendering it empty.

Autodesk.Revit.DB.SolidArray.Size
System.Int32
get
Returns the number of solids that are in the array.

Autodesk.Revit.DB.SolidArray.Item(System.Int32)
System.Object
Gets or sets a solid at a specified index within the array.
index: The index of the solid to be set or retrieved.
Returns: Returns the solid at the specified index.

Autodesk.Revit.DB.SolidArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.